html/20231130T203401--seb-nixos-installation__linux_nixos_nonpost_wsl.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-19 Tue 21:03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>seb nixos installation</title>
<meta name="author" content="Arvydas Gasparavicius" />
<meta name="description" content="welcome to my site" />
<meta name="keywords" content="emacs antanas geles" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../static/css/org-html-style-default.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/generic.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/taingram.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/lightbox.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/scroll-to-top.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="sitemap.html">NOTES </a>
 
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="preamble" class="status">
<div id="updated">Updated: 2023-12-15 Fri 19:50</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">seb nixos installation</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd9632ff">1. <span class="todo TODO">TODO</span> do smth about this</a></li>
<li><a href="#org20fc470">2. seb nixos installation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="NONPOST">NONPOST</span></span></a>
<ul>
<li><a href="#orgb68d3bb">2.1. Install NixOS</a></li>
<li><a href="#org8eb9f65">2.2. Clone your own customization to NixOS</a></li>
<li><a href="#org54c05da">2.3. Generate a GPG key</a>
<ul>
<li><a href="#orgfc7633d">2.3.1. preparation</a></li>
<li><a href="#orga586e2c">2.3.2. generating the key</a></li>
</ul>
</li>
<li><a href="#org6bc5da4">2.4. Running Eamcs in NixOS</a></li>
<li><a href="#org689004a">2.5. GIT authentication</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orgd9632ff" class="outline-2">
<h2 id="orgd9632ff"><span class="section-number-2">1.</span> <span class="todo TODO">TODO</span> do smth about this</h2>
</div>

<div id="outline-container-org20fc470" class="outline-2">
<h2 id="org20fc470"><span class="section-number-2">2.</span> seb nixos installation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="gaidNONPOST">NONPOST</span></span></h2>
<div class="outline-text-2" id="text-2">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2023-11-30 Thu&gt; </span></span> While trying to figure out how sebwsl works, I was chatting
with the Swedish guy, master linux guy, master computers guy, master
automatisations guy and has mentioned nixos a few times. I decided to give it a
try since I have such a willing helping me with everything. Fun fact - he is
the first person I was chatting with that is using Emacs(over the last 3 or so
years me using emacs, I have never been so close to someone using Emacs as
well! In my workplace(other country tho))!!!! His config must be sick, can't
wait to check it.
</p>

<p>
sebnix repo - <a href="https://github.sebank.se/sebnix/sebnix">https://github.sebank.se/sebnix/sebnix</a>
kurejo configas - <a href="https://github.sebank.se/s2450g/config">https://github.sebank.se/s2450g/config</a>
docs? - <a href="https://nix-community.github.io/home-manager/options.html">https://nix-community.github.io/home-manager/options.html</a>
</p>
</div>

<div id="outline-container-orgb68d3bb" class="outline-3">
<h3 id="orgb68d3bb"><span class="section-number-3">2.1.</span> Install NixOS</h3>
<div class="outline-text-3" id="text-2-1">
<p>
download nix installation
</p>

<p>
<a href="https://github.sebank.se/sebnix/sebnix/releases/download/v0.3.2/nixos-wsl.tar.gz">https://github.sebank.se/sebnix/sebnix/releases/download/v0.3.2/nixos-wsl.tar.gz</a>
</p>

<p>
probably its in downloads. go to downloads folder, open cmd and run:
</p>

<p>
wsl &#x2013;import nixos .\nixos .\nixos-wsl.tar.gz
</p>

<p>
wsl &#x2013;setdefault nixos
</p>

<p>
wsl &#x2013;list &#x2013;verbose (you can see that it also installed the wsl-vpnkit(kad kol
kas butu prisjunges prie vpn galeciau pasiekti external ir sebinius resources.
Jeigu atsiungiu nuo vpn - tuomet galiu viska pasiekti. Bet iprastai juk mes
dirbam per vpn, tai del to ir reikia tokio paejimo. Naudojant sebwsl sita
vpn-kit reiketu runinti su atskira komanda - "wsl.exe -d wsl-vpnkit &#x2013;cd /app
wsl-vpnkit"))
</p>

<p>
wsl &#x2013;list &#x2013;verbose
</p>

<p>
wsl &#x2013;distribution nixos
</p>

<p>
you are in.
</p>

<p>
random username, random location. Plain configuration, nothing in it yet.
</p>

<p>
Check if you can do ping.. quite important aht vpn-kit is running. It is built
in into sebnix, or otherwise sebwsl has that one also. `sebwsl apply
vpnkit-install` installs it. Check if its running also.
</p>

<p>
can run it like so manually in another terminal, dont stop the process. It
allows you to access things over wsl and over vpn - `wsl.exe -d wsl-vpnkit &#x2013;cd
/app wsl-vpnkit`
</p>

<p>
If nixos is running and you try to launch sebwsl - it will say that the stuff
is taken.
</p>

<p>
So what worked for me is to:
</p>
<ul class="org-ul">
<li>wsl &#x2013;shutdown</li>
<li>wsl -l -v</li>
<li>make sure viskas shuttinosi down</li>
<li>run dis(not sure if needed) - wsl.exe -d wsl-vpnkit &#x2013;cd /app wsl-vpnkit</li>
<li>wsl -d nixos</li>
</ul>

<p>
Customize your system with(runs emacs command temporarily just to edit the
config file, it does not install emacs(that we specify in nixos config files):
</p>

<div class="org-src-container">
<pre class="src src-bash"># Make system customizations
sudo nix run nixpkgs#emacs /etc/nixos/system.nix
# Make user
sudo nix run nixpkgs#emacs /etc/nixos/home.nix
</pre>
</div>
</div>
</div>

<div id="outline-container-org8eb9f65" class="outline-3">
<h3 id="org8eb9f65"><span class="section-number-3">2.2.</span> Clone your own customization to NixOS</h3>
<div class="outline-text-3" id="text-2-2">
<p>
rm -rf /etc/nixos
git clone <a href="https://github.sebank.se/s2753g/nixos.gi">https://github.sebank.se/s2753g/nixos.gi</a> into /etc
</p>

<p>
if asks, do this:
</p>

<p>
git config &#x2013;global &#x2013;add safe.directory /etc/nixos
</p>

<p>
then this:
</p>

<p>
sudo git checkout -b master
</p>
</div>
</div>

<div id="outline-container-org54c05da" class="outline-3">
<h3 id="org54c05da"><span class="section-number-3">2.3.</span> Generate a GPG key</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgfc7633d" class="outline-4">
<h4 id="orgfc7633d"><span class="section-number-4">2.3.1.</span> preparation</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
we need gpg key for further configs. Curerntly we can not generate the
gpg key since it is not installed on nix by default.
</p>

<p>
make config to look like this to be able to generate gpg key:
</p>

<p>
flake.nix:
</p>

<div class="org-src-container">
<pre class="src src-bash">{
  description = "A SEBNix WSL configuration";

  inputs = {
    sebnix.url = "git+https://github.sebank.se/sebnix/sebnix.git";
    nixpkgs.follows = "sebnix/nixpkgs";
  };

  outputs = inputs: {
    nixosConfigurations.wsl = inputs.nixpkgs.lib.nixosSystem {
      system = "x86_64-linux";
      modules = [
        inputs.sebnix.nixosModules.seb
        ./system.nix
      ];
    };
  };
}
</pre>
</div>

<p>
system.nix:
</p>

<div class="org-src-container">
<pre class="src src-bash">{
  networking.hostName = "wsl";

  seb = {
    sid = "s2753g";
    name = "Arvydas Gasparavicius";

    home = ./home.nix;
    wsl.enable = true;
  };

  wsl = {
    tarball.configPath = ./.;
    usbip.enable = true;
  };

  system.stateVersion = "23.05";
}
</pre>
</div>


<p>
home.nix:
</p>

<div class="org-src-container">
<pre class="src src-bash">{pkgs, ...}: {
    programs.gpg.enable = true;
    services.gpg-agent.enable = true;

  home.packages = [
    pkgs.direnv
    pkgs.ghq
  ];

  home.stateVersion = "23.05";
}
</pre>
</div>


<p>
check if wsl-vpnkit-auto works
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo systemctl status wsl-vpnkit-auto
sudo systemctl restart wsl-vpnkit-auto
</pre>
</div>

<p>
Apply configuration
sudo nixos-rebuild switch
</p>

<p>
after rebuild shutdown wsl:
wsl &#x2013;shutdown
</p>

<p>
start wsl again and enter it
wsl -d nixos
</p>

<p>
now you should see your own username, you are logged in as it
</p>
</div>
</div>

<div id="outline-container-orga586e2c" class="outline-4">
<h4 id="orga586e2c"><span class="section-number-4">2.3.2.</span> generating the key</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
try to run generate gpg key by following:
<a href="https://docs.github.com/en/authentication/managing-commit-signature-verification/generating-a-new-gpg-key">https://docs.github.com/en/authentication/managing-commit-signature-verification/generating-a-new-gpg-key</a>
</p>

<p>
gpg &#x2013;full-generate-key
</p>

<p>
enter enter enter everything
</p>

<p>
follow the instructions further and use the key, which in this case is <code>7D1XXXF66CXXXEC43</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org6bc5da4" class="outline-3">
<h3 id="org6bc5da4"><span class="section-number-3">2.4.</span> Running Eamcs in NixOS</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Currently experiencing the glitching bug, but can run emacs this way after installing it with:
</p>

<p>
sudo nix run nixpkgs#emacs29-pgtk
and then run it:
sudo , emacs -nw (you can run any application like that without installing)
</p>

<p>
To install the application yo need to add it to home.nix:
</p>

<p>
{pkgs, &#x2026;}: {
  programs.gpg.enable = true;
  services.gpg-agent.enable = true;
</p>

<p>
home.packages = [
  pkgs.direnv
  pkgs.ghq
  pkgs.vim # new
  pkgs.tmux # new
  pkgs.emacs29 # new
];
</p>

<p>
  home.stateVersion = "23.05";
}
</p>

<p>
then run `sudo nixos-rebuild switch` to install the packages. (hopefully youll have vpnkit active to fetch the things)
</p>

<p>
can now run vim, emacs, tmux usually like you would. Sadly emacs still has gliches and can run it only wiht emacs -nw
</p>
</div>
</div>

<div id="outline-container-org689004a" class="outline-3">
<h3 id="org689004a"><span class="section-number-3">2.5.</span> GIT authentication</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr/>
	 <footer>
	 <div class="copyright-container">
	 <div class="copyright">
	 Copyright &copy; 2023-2023 Arvydas Gasparavicius
	 </div>
	 </div>
	 <p class="date">This org file is created: 2023-11-30 Thu 20:34</p>
	 <p class="date">This org file is last modified: 2023-12-15 Fri 19:50</p>
	 <p class="date">This org file is exported to HTML: 2023-12-19 Tue 21:03</p>
	 <div class="generated">
	Created with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6) on <a href="https://www.gnu.org">GNU</a>/<a href="https://www.kernel.org/">Linux</a>
	</div>
	</footer>
	 <button onclick="topFunction()" id="myBtn" title="Go to top">Top</button>
	 <script src="../static/js/generic.js"></script>
	 <script src="../static/js/scroll-to-top.js"></script>
	 <script src="../static/js/lightbox.js"></script>
</div>
</body>
</html>